intro-julia.org
#+TITLE:    Introduction to =julia=
#+AUTHOR:   G. Jay Kerns
#+EMAIL:    gkerns@ysu.edu
#+DATE:     March 2, 2013
#+OPTIONS:  H:2
#+PROPERTY: exports both
#+PROPERTY: results output
#+PROPERTY: session *julia*
#+PROPERTY: tangle yes
#+LaTeX_HEADER: \DeclareUnicodeCharacter{22EE}{\vdots}

\vspace{0.25in}

This document is a /brief/ introduction to =julia=. It is a reworked
/Brief Introduction to R/ (which is an abbreviated Chapter 2 of [[http:ipsur.org][IPSUR]])
which I usually distribute to students using R for the first time.
One of the reasons for this document is that I wanted to get better
acquainted with =julia= and thought it might make it easier for others
to get better acquainted with it, too. In what follows, we assume you
have at least a passing familiarity with Org-mode and Emacs
keybindings.

Please bear in mind that the discussion below is written as if a
person has launched =julia= with =M-x julia= and is sitting in front
of an ESS =julia= interactive session right now.  But that isn't
required.  In fact, one of the best things about Org-mode is that such
a thing in fact *is not* required, and a person can happily breeze
through an org file tapping =C-c C-c= as (s)he goes.  For the purpose
of this introductory document it doesn't matter which approach you
use; be warned, however, that some of the lower code blocks depend on
values from the upper code blocks and if you try to execute them out
of order then you will get an error.

* What you need to get started

You will need to install [[http://julialang.org][=julia=]], a recent version of [[http://ess.r-project.org][ESS]], and an
updated version of [[http://orgmode.org][Org-mode]].  Instructions for how to accomplish all
three tasks are detailed in [[file:ob-julia-doc.org][Org-mode and =julia=: an introduction]].
Please read that document first to get up to speed before continuing.

*Note:* several code blocks below have the header argument =:eval
  no-export= which means that the code block can be evaluated
  interactively in this session by =C-c C-c= with point in the code
  block but will /not/ be evaluated during export.  The reason is that
  those blocks have settings which conflict with my current setup yet
  are meant to be useful for others people.

* Getting started with julia

** Communicating with julia

There are three basic methods (provided by ESS) for communicating with
=julia=.

- *An Interactive session (julia>).* This is the most basic way to
  complete simple, one-line commands. Do =M-x julia RET= during an
  Emacs session and the Emacs/ESS =julia= mode will open in a buffer.
  Type whatever command you like; =julia= will evaluate what is typed
  there and output the results in the buffer.  This method is akin to
  launching =julia= in a terminal.

- *Source files.* For longer programs (called /scripts/) there is too
  much code to write all at once in an interactive session. Further,
  sometimes we only wish to modify a small piece of the script and
  before running it again in =julia=.

  The way to do this is to open a dedicated =julia= script buffer with
  the sequence =C-x C-f whatever.jl=, where =whatever.jl= is a =julia=
  script which you've named whatever. Write the code in the buffer,
  then when satisfied the user evaluates lines or regions according to
  the following table. Then =julia= will evaluate the respective code
  and give output in the interactive buffer.

  | =C-RET=   | Send region or current line and step to next line of code.  |
  | =M-C-x=   | Send region or function or paragraph.                       |
  | =C-c C-c= | Send region or function or paragraph and step to next line. |

- *Script mode.* It is also possible to write a =julia= script (say, =myscript.jl= and evaluate the script from a terminal like this:

  : ~$ julia myscript.jl

  Depending on what's in the script, =julia= can be instructed to do
  all sorts of things.  See =julia --help= for additional
  options. (Note: you will need to add =julia= to your =PATH= or
  otherwise execute =julia= from its location before proceeding with
  this method.)

