HTML/intro-julia.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
	       "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Introduction to <code>julia</code></title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Introduction to <code>julia</code>"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="March 2, 2013"/>
<meta name="author" content="G. Jay Kerns"/>
</head>
<body>
<div id="content">
<h1 class="title">Introduction to <code>julia</code></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. What you need to get started</a></li>
<li><a href="#sec-2">2. Getting started with julia</a>
<ul>
<li><a href="#sec-2-1">2.1. Communicating with julia</a></li>
<li><a href="#sec-2-2">2.2. <code>julia</code> is one fancy calculator</a></li>
<li><a href="#sec-2-3">2.3. Getting Help</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Other tips</a>
<ul>
<li><a href="#sec-3-1">3.1. Other resources</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Plotting with Winston</a></li>
<li><a href="#sec-5">5. Fitting (generalized) linear models</a></li>
</ul>
</div>
</div>
<p>
\vspace{0.25in}
</p>

<p>
This document is a <i>brief</i> introduction to <code>julia</code>. It is a reworked
<i>Brief Introduction to R</i> (which is an abbreviated Chapter 2 of <a href="http:ipsur.org" >IPSUR</a>)
which I usually distribute to students using R for the first time.
One of the reasons for this document is that I wanted to get better
acquainted with <code>julia</code> and thought it might make it easier for others
to get better acquainted with it, too. In what follows, we assume you
have at least a passing familiarity with Org-mode and Emacs
keybindings.
</p>

<p>
Please bear in mind that the discussion below is written as if a
person has launched <code>julia</code> with <code>M-x julia</code> and is sitting in front
of an ESS <code>julia</code> interactive session right now.  But that isn't
required.  In fact, one of the best things about Org-mode is that such
a thing in fact <b>is not</b> required, and a person can happily breeze
through an org file tapping <code>C-c C-c</code> as (s)he goes.  For the purpose
of this introductory document it doesn't matter which approach you
use; be warned, however, that some of the lower code blocks depend on
values from the upper code blocks and if you try to execute them out
of order then you will get an error.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What you need to get started</h2>
<div class="outline-text-2" id="text-1">
<p>
You will need to install <a href="http://julialang.org" ><code>julia</code></a>, a recent version of <a href="http://ess.r-project.org" >ESS</a>, and an
updated version of <a href="http://orgmode.org" >Org-mode</a>.  Instructions for how to accomplish all
three tasks are detailed in <a href="ob-julia-doc.html" >Org-mode and <code>julia</code>: an introduction</a>.
Please read that document first to get up to speed before continuing.
</p>

<p>
<b>Note:</b> several code blocks below have the header argument <code>:eval
  no-export</code> which means that the code block can be evaluated
  interactively in this session by <code>C-c C-c</code> with point in the code
  block but will <i>not</i> be evaluated during export.  The reason is that
  those blocks have settings which conflict with my current setup yet
  are meant to be useful for others people.
</p>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Getting started with julia</h2>
<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Communicating with julia</h3>
<div class="outline-text-3" id="text-2-1">
<p>
There are three basic methods (provided by ESS) for communicating with
<code>julia</code>.
</p>

<ul class="org-ul">
<li><b>An Interactive session (julia&gt;).</b> This is the most basic way to
complete simple, one-line commands. Do <code>M-x julia RET</code> during an
Emacs session and the Emacs/ESS <code>julia</code> mode will open in a buffer.
Type whatever command you like; <code>julia</code> will evaluate what is typed
there and output the results in the buffer.  This method is akin to
launching <code>julia</code> in a terminal.
</li>

<li><b>Source files.</b> For longer programs (called <i>scripts</i>) there is too
much code to write all at once in an interactive session. Further,
sometimes we only wish to modify a small piece of the script and
before running it again in <code>julia</code>.

<p>
The way to do this is to open a dedicated <code>julia</code> script buffer with
the sequence <code>C-x C-f whatever.jl</code>, where <code>whatever.jl</code> is a <code>julia</code>
script which you've named whatever. Write the code in the buffer,
then when satisfied the user evaluates lines or regions according to
the following table. Then <code>julia</code> will evaluate the respective code
and give output in the interactive buffer.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col class="left"/>

<col class="left"/>
</colgroup>
<tbody>
<tr>
<td class="left"><code>C-RET</code></td>
<td class="left">Send region or current line and step to next line of code.</td>
</tr>

<tr>
<td class="left"><code>M-C-x</code></td>
<td class="left">Send region or function or paragraph.</td>
</tr>

<tr>
<td class="left"><code>C-c C-c</code></td>
<td class="left">Send region or function or paragraph and step to next line.</td>
</tr>
</tbody>
</table>
</li>

<li><b>Script mode.</b> It is also possible to write a <code>julia</code> script (say, <code>myscript.jl</code> and evaluate the script from a terminal like this:

<pre class="example">
~$ julia myscript.jl
</pre>

<p>
Depending on what's in the script, <code>julia</code> can be instructed to do
all sorts of things.  See <code>julia --help</code> for additional
options. (Note: you will need to add <code>julia</code> to your <code>PATH</code> or
otherwise execute <code>julia</code> from its location before proceeding with
this method.)
</p>
</li>
</ul>
</div>
</div>
