tex/intro-julia.tex
% Created 2013-03-02 Sat 22:40
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\DeclareUnicodeCharacter{22EE}{\vdots}
\author{G. Jay Kerns}
\date{March 2, 2013}
\title{Introduction to \texttt{julia}}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Generated by Org mode 7.9.3f in Emacs 24.3.50.1.}}
\begin{document}

\maketitle
\tableofcontents

\vspace{0.25in}

This document is a \emph{brief} introduction to \texttt{julia}. It is a reworked
\emph{Brief Introduction to R} (which is an abbreviated Chapter 2 of \href{http:ipsur.org}{IPSUR})
which I usually distribute to students using R for the first time.
One of the reasons for this document is that I wanted to get better
acquainted with \texttt{julia} and thought it might make it easier for others
to get better acquainted with it, too. In what follows, we assume you
have at least a passing familiarity with Org-mode and Emacs
keybindings.

Please bear in mind that the discussion below is written as if a
person has launched \texttt{julia} with \texttt{M-x julia} and is sitting in front
of an ESS \texttt{julia} interactive session right now.  But that isn't
required.  In fact, one of the best things about Org-mode is that such
a thing in fact \textbf{is not} required, and a person can happily breeze
through an org file tapping \texttt{C-c C-c} as (s)he goes.  For the purpose
of this introductory document it doesn't matter which approach you
use; be warned, however, that some of the lower code blocks depend on
values from the upper code blocks and if you try to execute them out
of order then you will get an error.

\section[What you need to get started]{What you need to get started}
\label{sec-1}

You will need to install \href{http://julialang.org}{\texttt{julia}}, a recent version of \href{http://ess.r-project.org}{ESS}, and an
updated version of \href{http://orgmode.org}{Org-mode}.  Instructions for how to accomplish all
three tasks are detailed in \href{file://ob-julia-doc.org}{Org-mode and \texttt{julia}: an introduction}.
Please read that document first to get up to speed before continuing.

\textbf{Note:} several code blocks below have the header argument \texttt{:eval
  no-export} which means that the code block can be evaluated
  interactively in this session by \texttt{C-c C-c} with point in the code
  block but will \emph{not} be evaluated during export.  The reason is that
  those blocks have settings which conflict with my current setup yet
  are meant to be useful for others people.
\section[Getting started with julia]{Getting started with julia}
\label{sec-2}

\subsection[Communicating with julia]{Communicating with julia}
\label{sec-2-1}

There are three basic methods (provided by ESS) for communicating with
\texttt{julia}.

\begin{itemize}
\item \textbf{An Interactive session (julia>).} This is the most basic way to
complete simple, one-line commands. Do \texttt{M-x julia RET} during an
Emacs session and the Emacs/ESS \texttt{julia} mode will open in a buffer.
Type whatever command you like; \texttt{julia} will evaluate what is typed
there and output the results in the buffer.  This method is akin to
launching \texttt{julia} in a terminal.

\item \textbf{Source files.} For longer programs (called \emph{scripts}) there is too
much code to write all at once in an interactive session. Further,
sometimes we only wish to modify a small piece of the script and
before running it again in \texttt{julia}.

The way to do this is to open a dedicated \texttt{julia} script buffer with
the sequence \texttt{C-x C-f whatever.jl}, where \texttt{whatever.jl} is a \texttt{julia}
script which you've named whatever. Write the code in the buffer,
then when satisfied the user evaluates lines or regions according to
the following table. Then \texttt{julia} will evaluate the respective code
and give output in the interactive buffer.

\begin{center}
\begin{tabular}{ll}
\texttt{C-RET} & Send region or current line and step to next line of code.\\
\texttt{M-C-x} & Send region or function or paragraph.\\
\texttt{C-c C-c} & Send region or function or paragraph and step to next line.\\
\end{tabular}
\end{center}

\item \textbf{Script mode.} It is also possible to write a \texttt{julia} script (say, \texttt{myscript.jl} and evaluate the script from a terminal like this:

\begin{verbatim}
~$ julia myscript.jl
\end{verbatim}

Depending on what's in the script, \texttt{julia} can be instructed to do
all sorts of things.  See \texttt{julia -{}-help} for additional
options. (Note: you will need to add \texttt{julia} to your \texttt{PATH} or
otherwise execute \texttt{julia} from its location before proceeding with
this method.)
\end{itemize}
