intro-julia.org
** =julia= is one fancy calculator

=julia= can do any arithmetic you can imagine. For example, in an
interactive session type =2 + 3= and observe

#+BEGIN_SRC julia
2 + 3
#+END_SRC

The =julia>= means that =julia= is waiting on your next command. Entry
numbers will be generated for each row, such as

#+BEGIN_SRC julia
[3:50]
#+END_SRC

#+RESULTS:
#+begin_example
48-element Int32 Array:
  3
  4
  5
  6
  7
  8
  9
 10
 11
 12
  ⋮
 41
 42
 43
 44
 45
 46
 47
 48
 49
 50
#+end_example

Notice that =julia= doesn't show the whole list of numbers, it elides
them with vertical ellipses \(\vdots\). Note also the =[3:50]=
notation, which generates all integers in sequence from 3 to 50. One
can also do things like

#+BEGIN_SRC julia :eval no-export
2 * 3 * 4 * 5  # multiply
sqrt(10)       # square root
pi             # pi
sqrt(-2)
#+END_SRC

#+RESULTS:
: 120
: 3.1622776601683795
: 3.141592653589793
: ERROR: DomainError()
:  in sqrt at math.jl:111

Notice that a =DomainError()= was produced; we are not allowed to take
square roots of negative numbers. Also notice the number sign =#=,
which is used for comments. Everything typed on the same line after
the =#= will be ignored by julia. There is no =julia= continuation
prompt. If you press =RET= before a statement is complete then empty
lines keep piling up until you finish the command.

Some other fuctions that will be of use are =abs()= for absolute
value, =log()= for the natural logarithm, =exp()= for the exponential
function, and =factorial()= for... uh... factorials.

Assignment is useful for storing values to be used later. Notice the
semicolon at the end of the first statement.  Without the semicolon,
=julia= would print the result of the assigment (namely, =5=).

#+BEGIN_SRC julia
y = 5;    # stores the value 5 in y
3 + y
#+END_SRC

#+RESULTS:
: 
: 8

There aren't other assignment operators (like =<-= in R).  For
variable names you can use letters (perhaps followed by) numbers,
and/or underscore "_" characters. You cannot use mathematical
operators, you cannot use dots, and numbers can't go in front of
numbers (those are interpreted by =julia= as coefficients). Here are
some valid variable names: =x=, =x1=, =y32=, =z_var=.

If you would like to enter the data 74,31,95,61,76,34,23,54,96 into
=julia=, you may create a data array with double brackets (the analogue
of the =c()= function in R).

#+BEGIN_SRC julia
fred = [74, 31, 95, 61, 76, 34, 23, 54, 96]
#+END_SRC

#+RESULTS:
#+begin_example
9-element Int32 Array:
 74
 31
 95
 61
 76
 34
 23
 54
 96
#+end_example

The array =fred= has 9 entries. We can access individual components
with bracket =[ ]= notation:

#+BEGIN_SRC julia
fred[3]
fred[2:4]
fred[[1, 3, 5, 8]]
#+END_SRC

#+RESULTS:
#+begin_example
95
3-element Int32 Array:
 31
 95
 61
4-element Int32 Array:
 74
 95
 76
 54
#+end_example

Notice we needed double brackets for the third example. If you would
like to empty the array =fred=, you can do it by typing =fred = []=.

Data arrays in =julia= have type. There are all sorts of integer types
(=Int8=, =uInt8=, =Int32=, ...), strings (=ASCIIString=), logical
(=Bool=), unicode characters (=Char=), then there are floating-point
types (=Float16=, =Float32=), even complex numbers like =1 + 2im= and
even rational numbers like =3//4=, not to mention =Inf=, =-Inf=, and
=NaN= (which stands for /not a number/). If you ever want to know what
it is you're dealing with you can find out with the =typeof= function.

#+BEGIN_SRC julia
simpsons = ["Homer", "Marge", "Bart", "Lisa", "Maggie"];
typeof(simpsons)
#+END_SRC

#+RESULTS:
: 
: Array{ASCIIString,1}

Here is an example of a logical vector:

#+BEGIN_SRC julia
x = 5;
x >= 6
#+END_SRC

#+RESULTS:
: 
: false

Notice the ~>=~ symbol which stands for "greater than or equal to".
Many functions in =julia= are vectorized. Once we have stored a data
vector then we can evaluate functions on it.

#+BEGIN_SRC julia
sum(fred)
length(fred)
sum(fred)/length(fred)
mean(fred)   # sample mean, should be same answer
#+END_SRC

#+RESULTS:
: 544
: 9
: 60.44444444444444
: 60.44444444444444

Other popular functions for vectors are =min()=, =max()=, =sort()=,
and =cumsum()=.

Arithmetic in =julia= is usually done element-wise, and the operands
(usually) must be of conformable dimensions.

#+BEGIN_SRC julia
mary = [4, 5, 3, 6, 4, 6, 7, 3, 1];
fred + mary
fred - mean(mary)
#+END_SRC

#+RESULTS:
#+begin_example

9-element Int32 Array:
 78
 36
 98
 67
 80
 40
 30
 57
 97
9-element Float64 Array:
 69.6667
 26.6667
 90.6667
 56.6667
 71.6667
 29.6667
 18.6667
 49.6667
 91.6667
#+end_example

The operations =+= and =-= are performed element-wise. Notice in the
last vector that =mean(fred)= was subtracted from each entry in
turn. This is also known as data recycling. Other popular vectorizing
functions are =sin()=, =cos()=, =exp()=, =log()=, and =sqrt()=.

An operation which is /not/ performed elementwise is array multiplication, =*=.  If were were to try =fred*mary= then we would get an error:

: ERROR: no method *(Array{Int32,1},Array{Int32,1})

The reason for the error is that =julia= is trying to do matrix multiplication on two =9x1= arrays which, we know from Linear Algebra, is not allowed. Instead, we can accomplish element-wise multiplication with the following:

#+BEGIN_SRC julia
fred.*mary
#+END_SRC

#+RESULTS:
#+begin_example
9-element Int32 Array:
 296
 155
 285
 366
 304
 204
 161
 162
  96
#+end_example

Notice the dot before the multiplication.  A similar trick works for
elementwise division.  By the way, with two =9x1= arrays it is legal
to compute the dot product like this:

#+BEGIN_SRC julia
fred'*mary
#+END_SRC

where notice we have transposed =fred= and done ordinary matrix
multiplication with =fred'*mary=.
 
