HTML/intro-julia.html
<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> <code>julia</code> is one fancy calculator</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<code>julia</code> can do any arithmetic you can imagine. For example, in an
interactive session type <code>2 + 3</code> and observe
</p>

<div class="org-src-container">

<pre class="src src-julia">2 + 3
</pre>
</div>

<pre class="example">
5
</pre>

<p>
The <code>julia></code> means that <code>julia</code> is waiting on your next command. Entry
numbers will be generated for each row, such as
</p>

<div class="org-src-container">

<pre class="src src-julia">[3:50]
</pre>
</div>

<pre class="example">
48-element Int32 Array:
  3
  4
  5
  6
  7
  8
  9
 10
 11
 12
  ⋮
 41
 42
 43
 44
 45
 46
 47
 48
 49
 50
</pre>

<p>
Notice that <code>julia</code> doesn't show the whole list of numbers, it elides
them with vertical ellipses \(\vdots\). Note also the <code>[3:50]</code>
notation, which generates all integers in sequence from 3 to 50. One
can also do things like
</p>

<div class="org-src-container">

<pre class="src src-julia">2 * 3 * 4 * 5  <span style="color: #b22222;"># </span><span style="color: #b22222;">multiply</span>
<span style="color: #0000ff;">sqrt</span>(10)       <span style="color: #b22222;"># </span><span style="color: #b22222;">square root</span>
pi             <span style="color: #b22222;"># </span><span style="color: #b22222;">pi</span>
<span style="color: #0000ff;">sqrt</span>(-2)
</pre>
</div>

<pre class="example">
120
3.1622776601683795
3.141592653589793
ERROR: DomainError()
 in sqrt at math.jl:111
</pre>

<p>
Notice that a <code>DomainError()</code> was produced; we are not allowed to take
square roots of negative numbers. Also notice the number sign <code>#</code>,
which is used for comments. Everything typed on the same line after
the <code>#</code> will be ignored by julia. There is no <code>julia</code> continuation
prompt. If you press <code>RET</code> before a statement is complete then empty
lines keep piling up until you finish the command.
</p>

<p>
Some other fuctions that will be of use are <code>abs()</code> for absolute
value, <code>log()</code> for the natural logarithm, <code>exp()</code> for the exponential
function, and <code>factorial()</code> for&hellip; uh&hellip; factorials.
</p>

<p>
Assignment is useful for storing values to be used later. Notice the
semicolon at the end of the first statement.  Without the semicolon,
<code>julia</code> would print the result of the assigment (namely, <code>5</code>).
</p>

<div class="org-src-container">

<pre class="src src-julia">y = 5;    <span style="color: #b22222;"># </span><span style="color: #b22222;">stores the value 5 in y</span>
3 + y
</pre>
</div>

<pre class="example">
8
</pre>

<p>
There aren't other assignment operators (like <code><-</code> in R).  For
variable names you can use letters (perhaps followed by) numbers,
and/or underscore "_" characters. You cannot use mathematical
operators, you cannot use dots, and numbers can't go in front of
numbers (those are interpreted by <code>julia</code> as coefficients). Here are
some valid variable names: <code>x</code>, <code>x1</code>, <code>y32</code>, <code>z_var</code>.
</p>

<p>
If you would like to enter the data 74,31,95,61,76,34,23,54,96 into
<code>julia</code>, you may create a data array with double brackets (the analogue
of the <code>c()</code> function in R).
</p>

<div class="org-src-container">

<pre class="src src-julia">fred = [74, 31, 95, 61, 76, 34, 23, 54, 96]
</pre>
</div>

<pre class="example">
9-element Int32 Array:
 74
 31
 95
 61
 76
 34
 23
 54
 96
</pre>

<p>
The array <code>fred</code> has 9 entries. We can access individual components
with bracket <code>[ ]</code> notation:
</p>

<div class="org-src-container">

<pre class="src src-julia">fred[3]
fred[2:4]
fred[[1, 3, 5, 8]]
</pre>
</div>

<pre class="example">
95
3-element Int32 Array:
 31
 95
 61
4-element Int32 Array:
 74
 95
 76
 54
</pre>

<p>
Notice we needed double brackets for the third example. If you would
like to empty the array <code>fred</code>, you can do it by typing <code>fred = []</code>.
</p>

<p>
Data arrays in <code>julia</code> have type. There are all sorts of integer types
(<code>Int8</code>, <code>uInt8</code>, <code>Int32</code>, &hellip;), strings (<code>ASCIIString</code>), logical
(<code>Bool</code>), unicode characters (<code>Char</code>), then there are floating-point
types (<code>Float16</code>, <code>Float32</code>), even complex numbers like <code>1 + 2im</code> and
even rational numbers like <code>3//4</code>, not to mention <code>Inf</code>, <code>-Inf</code>, and
<code>NaN</code> (which stands for <i>not a number</i>). If you ever want to know what
it is you're dealing with you can find out with the <code>typeof</code> function.
</p>

<div class="org-src-container">

<pre class="src src-julia">simpsons = [<span style="color: #8b2252;">"Homer"</span>, <span style="color: #8b2252;">"Marge"</span>, <span style="color: #8b2252;">"Bart"</span>, <span style="color: #8b2252;">"Lisa"</span>, <span style="color: #8b2252;">"Maggie"</span>];
<span style="color: #0000ff;">typeof</span>(simpsons)
</pre>
</div>

<pre class="example">
Array{ASCIIString,1}
</pre>

<p>
Here is an example of a logical vector:
</p>

<div class="org-src-container">

<pre class="src src-julia">x = 5;
x &gt;= 6
</pre>
</div>

<pre class="example">
false
</pre>

<p>
Notice the <code>>=</code> symbol which stands for "greater than or equal to".
Many functions in <code>julia</code> are vectorized. Once we have stored a data
vector then we can evaluate functions on it.
</p>

<div class="org-src-container">

<pre class="src src-julia"><span style="color: #0000ff;">sum</span>(fred)
<span style="color: #0000ff;">length</span>(fred)
<span style="color: #0000ff;">sum</span>(fred)/<span style="color: #0000ff;">length</span>(fred)
<span style="color: #0000ff;">mean</span>(fred)   <span style="color: #b22222;"># </span><span style="color: #b22222;">sample mean, should be same answer</span>
</pre>
</div>

<pre class="example">
544
9
60.44444444444444
60.44444444444444
</pre>

<p>
Other popular functions for vectors are <code>min()</code>, <code>max()</code>, <code>sort()</code>,
and <code>cumsum()</code>.
</p>

<p>
Arithmetic in <code>julia</code> is usually done element-wise, and the operands
(usually) must be of conformable dimensions.
</p>

<div class="org-src-container">

<pre class="src src-julia">mary = [4, 5, 3, 6, 4, 6, 7, 3, 1];
fred + mary
fred - <span style="color: #0000ff;">mean</span>(mary)
</pre>
</div>

<pre class="example">
9-element Int32 Array:
 78
 36
 98
 67
 80
 40
 30
 57
 97
9-element Float64 Array:
 69.6667
 26.6667
 90.6667
 56.6667
 71.6667
 29.6667
 18.6667
 49.6667
 91.6667
</pre>

<p>
The operations <code>+</code> and <code>-</code> are performed element-wise. Notice in the
last vector that <code>mean(fred)</code> was subtracted from each entry in
turn. This is also known as data recycling. Other popular vectorizing
functions are <code>sin()</code>, <code>cos()</code>, <code>exp()</code>, <code>log()</code>, and <code>sqrt()</code>.
</p>

<p>
An operation which is <i>not</i> performed elementwise is array multiplication, <code>*</code>.  If were were to try <code>fred*mary</code> then we would get an error:
</p>

<pre class="example">
ERROR: no method *(Array{Int32,1},Array{Int32,1})
</pre>

<p>
The reason for the error is that <code>julia</code> is trying to do matrix multiplication on two <code>9x1</code> arrays which, we know from Linear Algebra, is not allowed. Instead, we can accomplish element-wise multiplication with the following:
</p>

<div class="org-src-container">

<pre class="src src-julia">fred.*mary
</pre>
</div>

<pre class="example">
9-element Int32 Array:
 296
 155
 285
 366
 304
 204
 161
 162
  96
</pre>

<p>
Notice the dot before the multiplication.  A similar trick works for
elementwise division.  By the way, with two <code>9x1</code> arrays it is legal
to compute the dot product like this:
</p>

<div class="org-src-container">

<pre class="src src-julia">fred<span style="color: #8b2252;">'*mary</span>
</pre>
</div>

<pre class="example">
1-element Int32 Array:
 2029
</pre>

<p>
where notice we have transposed <code>fred</code> and done ordinary matrix
multiplication with <code>fred'*mary</code>.
</p>
</div>
</div>
