tex/intro-julia.tex
\subsection[\texttt{julia} is one fancy calculator]{\texttt{julia} is one fancy calculator}
\label{sec-2-2}

\texttt{julia} can do any arithmetic you can imagine. For example, in an
interactive session type \texttt{2 + 3} and observe

\begin{verbatim}
2 + 3
\end{verbatim}

\begin{verbatim}
5
\end{verbatim}

The \texttt{julia>} means that \texttt{julia} is waiting on your next command. Entry
numbers will be generated for each row, such as

\begin{verbatim}
[3:50]
\end{verbatim}

\begin{verbatim}
48-element Int32 Array:
  3
  4
  5
  6
  7
  8
  9
 10
 11
 12
  ⋮
 41
 42
 43
 44
 45
 46
 47
 48
 49
 50
\end{verbatim}

Notice that \texttt{julia} doesn't show the whole list of numbers, it elides
them with vertical ellipses \(\vdots\). Note also the \texttt{[3:50]}
notation, which generates all integers in sequence from 3 to 50. One
can also do things like

\begin{verbatim}
2 * 3 * 4 * 5  # multiply
sqrt(10)       # square root
pi             # pi
sqrt(-2)
\end{verbatim}

\begin{verbatim}
120
3.1622776601683795
3.141592653589793
ERROR: DomainError()
 in sqrt at math.jl:111
\end{verbatim}

Notice that a \texttt{DomainError()} was produced; we are not allowed to take
square roots of negative numbers. Also notice the number sign \texttt{\#},
which is used for comments. Everything typed on the same line after
the \texttt{\#} will be ignored by julia. There is no \texttt{julia} continuation
prompt. If you press \texttt{RET} before a statement is complete then empty
lines keep piling up until you finish the command.

Some other fuctions that will be of use are \texttt{abs()} for absolute
value, \texttt{log()} for the natural logarithm, \texttt{exp()} for the exponential
function, and \texttt{factorial()} for\ldots{} uh\ldots{} factorials.

Assignment is useful for storing values to be used later. Notice the
semicolon at the end of the first statement.  Without the semicolon,
\texttt{julia} would print the result of the assigment (namely, \texttt{5}).

\begin{verbatim}
y = 5;    # stores the value 5 in y
3 + y
\end{verbatim}

\begin{verbatim}

8
\end{verbatim}

There aren't other assignment operators (like \texttt{<-} in R).  For
variable names you can use letters (perhaps followed by) numbers,
and/or underscore "\_" characters. You cannot use mathematical
operators, you cannot use dots, and numbers can't go in front of
numbers (those are interpreted by \texttt{julia} as coefficients). Here are
some valid variable names: \texttt{x}, \texttt{x1}, \texttt{y32}, \texttt{z\_var}.

If you would like to enter the data 74,31,95,61,76,34,23,54,96 into
\texttt{julia}, you may create a data array with double brackets (the analogue
of the \texttt{c()} function in R).

\begin{verbatim}
fred = [74, 31, 95, 61, 76, 34, 23, 54, 96]
\end{verbatim}

\begin{verbatim}
9-element Int32 Array:
 74
 31
 95
 61
 76
 34
 23
 54
 96
\end{verbatim}

The array \texttt{fred} has 9 entries. We can access individual components
with bracket \texttt{[ ]} notation:

\begin{verbatim}
fred[3]
fred[2:4]
fred[[1, 3, 5, 8]]
\end{verbatim}

\begin{verbatim}
95
3-element Int32 Array:
 31
 95
 61
4-element Int32 Array:
 74
 95
 76
 54
\end{verbatim}

Notice we needed double brackets for the third example. If you would
like to empty the array \texttt{fred}, you can do it by typing \texttt{fred = []}.

Data arrays in \texttt{julia} have type. There are all sorts of integer types
(\texttt{Int8}, \texttt{uInt8}, \texttt{Int32}, \ldots{}), strings (\texttt{ASCIIString}), logical
(\texttt{Bool}), unicode characters (\texttt{Char}), then there are floating-point
types (\texttt{Float16}, \texttt{Float32}), even complex numbers like \texttt{1 + 2im} and
even rational numbers like \texttt{3//4}, not to mention \texttt{Inf}, \texttt{-Inf}, and
\texttt{NaN} (which stands for \emph{not a number}). If you ever want to know what
it is you're dealing with you can find out with the \texttt{typeof} function.

\begin{verbatim}
simpsons = ["Homer", "Marge", "Bart", "Lisa", "Maggie"];
typeof(simpsons)
\end{verbatim}

\begin{verbatim}

Array{ASCIIString,1}
\end{verbatim}

Here is an example of a logical vector:

\begin{verbatim}
x = 5;
x >= 6
\end{verbatim}

\begin{verbatim}

false
\end{verbatim}

Notice the \verb~>=~ symbol which stands for "greater than or equal to".
Many functions in \texttt{julia} are vectorized. Once we have stored a data
vector then we can evaluate functions on it.

\begin{verbatim}
sum(fred)
length(fred)
sum(fred)/length(fred)
mean(fred)   # sample mean, should be same answer
\end{verbatim}

\begin{verbatim}
544
9
60.44444444444444
60.44444444444444
\end{verbatim}

Other popular functions for vectors are \texttt{min()}, \texttt{max()}, \texttt{sort()},
and \texttt{cumsum()}.

Arithmetic in \texttt{julia} is usually done element-wise, and the operands
(usually) must be of conformable dimensions.

\begin{verbatim}
mary = [4, 5, 3, 6, 4, 6, 7, 3, 1];
fred + mary
fred - mean(mary)
\end{verbatim}

\begin{verbatim}
9-element Int32 Array:
 78
 36
 98
 67
 80
 40
 30
 57
 97
9-element Float64 Array:
 69.6667
 26.6667
 90.6667
 56.6667
 71.6667
 29.6667
 18.6667
 49.6667
 91.6667
\end{verbatim}

The operations \texttt{+} and \texttt{-} are performed element-wise. Notice in the
last vector that \texttt{mean(fred)} was subtracted from each entry in
turn. This is also known as data recycling. Other popular vectorizing
functions are \texttt{sin()}, \texttt{cos()}, \texttt{exp()}, \texttt{log()}, and \texttt{sqrt()}.

An operation which is \emph{not} performed elementwise is array multiplication, \texttt{*}.  If were were to try \texttt{fred*mary} then we would get an error:

\begin{verbatim}
ERROR: no method *(Array{Int32,1},Array{Int32,1})
\end{verbatim}

The reason for the error is that \texttt{julia} is trying to do matrix multiplication on two \texttt{9x1} arrays which, we know from Linear Algebra, is not allowed. Instead, we can accomplish element-wise multiplication with the following:

\begin{verbatim}
fred.*mary
\end{verbatim}

\begin{verbatim}
9-element Int32 Array:
 296
 155
 285
 366
 304
 204
 161
 162
  96
\end{verbatim}

Notice the dot before the multiplication.  A similar trick works for
elementwise division.  By the way, with two \texttt{9x1} arrays it is legal
to compute the dot product like this:

\begin{verbatim}
fred'*mary
\end{verbatim}

\begin{verbatim}
1-element Int32 Array:
 2029
\end{verbatim}

where notice we have transposed \texttt{fred} and done ordinary matrix
multiplication with \texttt{fred'*mary}.
