intro-julia.org
** Getting Help

When you get in the thick of =julia= you will soon find yourself
looking for help. The help resources for =julia= are not (yet) as
extensive as those for some other languages that have been around for
a while (such as R).  =julia= is new and many of the help topics
haven't been written yet.  Nevertheless, sometimes a person is lucky
and you can get help on a function when it's available with the
=help()= function.

#+BEGIN_SRC julia
help("factorial")
#+END_SRC

#+RESULTS:
: Base.factorial(n)
: 
:    Factorial of n
: 
: Base.factorial(n, k)
: 
:    Compute "factorial(n)/factorial(k)"

In addition to this, you can type =help()= which gives an extended
list of help topics.  For instance, I find myself doing
=help("Statistics")= a lot.

* Other tips

It is unnecessary to retype commands repeatedly, since Emacs/ESS
remembers what you have entered at the =julia>= prompt. To navigate
through previous commands put point at the lowest command line and
do either =M-p= or =M-n=.

** Other resources

- Check out the official =julia= manual [[http://docs.julialang.org/en/latest/manual/][here]].
- The /Standard Library/ (a different type of manual) is [[http://docs.julialang.org/en/latest/stdlib/][here]].
- There is a vibrant and growing =julia= community whose gateway is [[http://julialang.org/community/][here]].
- There is a large and growing list of contributed packages [[http://docs.julialang.org/en/latest/packages/packagelist/][here]].

* Plotting with Winston

There's a pretty well fleshed out plotting example in the Graphics
section of [[file:ob-julia-doc.org][Org-mode and =julia=: an introduction]].  Check it out.

* Fitting (generalized) linear models

Douglas Bates (of [[http://www.springer.com/statistics/statistical+theory+and+methods/book/978-1-4419-0317-4][Mixed Effects Models in S and S-PLUS]] fame) has been
putting together a =julia= package called GLM which already supports
fitting generalized linear models to datasets.  This, together with
the RDatasets package means there is already a bunch of stuff to keep
a person busy.  Below is a modified example from the Multiple
Regression chapter of IPSUR, translated to =julia= speak.

First, we start =using= the packages we'll need.

#+BEGIN_SRC julia :exports code
using RDatasets, DataFrames, Distributions, GLM
#+END_SRC

#+RESULTS:

Next we load the =trees= data frame from the RDatasets package (via
the DataFrames package) and fit a linear model to the data.

#+BEGIN_SRC julia :exports code :results silent
trees = data("datasets", "trees")
treeslm = lm(:(Girth ~ Height + Volume), trees)
#+END_SRC

There is a /ton/ of output from both the above commands which we omit
here for the sake of brevity.  Most of it, though, is similar to to
output we might see in an R session.  We can extract the model
coefficients with the =coef= function:

#+BEGIN_SRC julia
coef(treeslm)
#+END_SRC

and we can finish by looking at a summary table similar to something
like =summary(treeslm)= in R.

#+BEGIN_SRC julia
coeftable(treeslm)
#+END_SRC
