HTML/intro-julia.html
<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Getting Help</h3>
<div class="outline-text-3" id="text-2-3">
<p>
When you get in the thick of <code>julia</code> you will soon find yourself
looking for help. The help resources for <code>julia</code> are not (yet) as
extensive as those for some other languages that have been around for
a while (such as R).  <code>julia</code> is new and many of the help topics
haven't been written yet.  Nevertheless, sometimes a person is lucky
and you can get help on a function when it's available with the
<code>help()</code> function.
</p>

<div class="org-src-container">

<pre class="src src-julia"><span style="color: #0000ff;">help</span>(<span style="color: #8b2252;">"factorial"</span>)
</pre>
</div>

<pre class="example">
Base.factorial(n)

   Factorial of n

Base.factorial(n, k)

   Compute "factorial(n)/factorial(k)"
</pre>

<p>
In addition to this, you can type <code>help()</code> which gives an extended
list of help topics.  For instance, I find myself doing
<code>help("Statistics")</code> a lot.
</p>
</div>
</div>
</div>
<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Other tips</h2>
<div class="outline-text-2" id="text-3">
<p>
It is unnecessary to retype commands repeatedly, since Emacs/ESS
remembers what you have entered at the <code>julia></code> prompt. To navigate
through previous commands put point at the lowest command line and
do either <code>M-p</code> or <code>M-n</code>.
</p>
</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Other resources</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Check out the official <code>julia</code> manual <a href="http://docs.julialang.org/en/latest/manual/" >here</a>.
</li>
<li>The <i>Standard Library</i> (a different type of manual) is <a href="http://docs.julialang.org/en/latest/stdlib/" >here</a>.
</li>
<li>There is a vibrant and growing <code>julia</code> community whose gateway is <a href="http://julialang.org/community/" >here</a>.
</li>
<li>There is a large and growing list of contributed packages <a href="http://docs.julialang.org/en/latest/packages/packagelist/" >here</a>.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Plotting with Winston</h2>
<div class="outline-text-2" id="text-4">
<p>
There's a pretty well fleshed out plotting example in the Graphics
section of <a href="ob-julia-doc.html" >Org-mode and <code>julia</code>: an introduction</a>.  Check it out.
</p>
</div>
</div>
<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Fitting (generalized) linear models</h2>
<div class="outline-text-2" id="text-5">
<p>
Douglas Bates (of <a href="http://www.springer.com/statistics/statistical+theory+and+methods/book/978-1-4419-0317-4" >Mixed Effects Models in S and S-PLUS</a> fame) has been
putting together a <code>julia</code> package called GLM which already supports
fitting generalized linear models to datasets.  This, together with
the RDatasets package means there is already a bunch of stuff to keep
a person busy.  Below is a modified example from the Multiple
Regression chapter of IPSUR, translated to <code>julia</code> speak.
</p>

<p>
First, we start <code>using</code> the packages we'll need.
</p>

<div class="org-src-container">

<pre class="src src-julia">using RDatasets, DataFrames, Distributions, GLM
</pre>
</div>

<p>
Next we load the <code>trees</code> data frame from the RDatasets package (via
the DataFrames package) and fit a linear model to the data.
</p>

<div class="org-src-container">

<pre class="src src-julia">trees = <span style="color: #0000ff;">data</span>(<span style="color: #8b2252;">"datasets"</span>, <span style="color: #8b2252;">"trees"</span>)
treeslm = <span style="color: #0000ff;">lm</span>(:(Girth ~ Height + Volume), trees)
</pre>
</div>

<p>
There is a <i>ton</i> of output from both the above commands which we omit
here for the sake of brevity.  Most of it, though, is similar to to
output we might see in an R session.  We can extract the model
coefficients with the <code>coef</code> function:
</p>

<div class="org-src-container">

<pre class="src src-julia"><span style="color: #0000ff;">coef</span>(treeslm)
</pre>
</div>

<pre class="example">
3-element Float64 Array:
 10.8164   
 -0.0454835
  0.19518
</pre>

<p>
and we can finish by looking at a summary table similar to something
like <code>summary(treeslm)</code> in R.
</p>

<div class="org-src-container">

<pre class="src src-julia"><span style="color: #0000ff;">coeftable</span>(treeslm)
</pre>
</div>

<pre class="example">
3x4 DataFrame:
          Estimate Std.Error  t value   Pr(&gt;|t|)
[1,]       10.8164    1.9732  5.48165 7.44691e-6
[2,]    -0.0454835 0.0282621 -1.60935   0.118759
[3,]       0.19518 0.0109553  17.8161 8.2233e-17
</pre>
</div>
</div>

</div><div id="postamble">
<p class="date">Date: March 2, 2013</p>
<p class="author">Author : G. Jay Kerns</p>
<p class="creator">Generated by <a href="http://orgmode.org">Org</a> mode 7.9.3f in <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.50.1.</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</body>
</html>
