tex/intro-julia.tex
\subsection[Getting Help]{Getting Help}
\label{sec-2-3}

When you get in the thick of \texttt{julia} you will soon find yourself
looking for help. The help resources for \texttt{julia} are not (yet) as
extensive as those for some other languages that have been around for
a while (such as R).  \texttt{julia} is new and many of the help topics
haven't been written yet.  Nevertheless, sometimes a person is lucky
and you can get help on a function when it's available with the
\texttt{help()} function.

\begin{verbatim}
help("factorial")
\end{verbatim}

\begin{verbatim}
Base.factorial(n)

   Factorial of n

Base.factorial(n, k)

   Compute "factorial(n)/factorial(k)"
\end{verbatim}

In addition to this, you can type \texttt{help()} which gives an extended
list of help topics.  For instance, I find myself doing
\texttt{help("Statistics")} a lot.
\section[Other tips]{Other tips}
\label{sec-3}

It is unnecessary to retype commands repeatedly, since Emacs/ESS
remembers what you have entered at the \texttt{julia>} prompt. To navigate
through previous commands put point at the lowest command line and
do either \texttt{M-p} or \texttt{M-n}.

\subsection[Other resources]{Other resources}
\label{sec-3-1}

\begin{itemize}
\item Check out the official \texttt{julia} manual \href{http://docs.julialang.org/en/latest/manual/}{here}.
\item The \emph{Standard Library} (a different type of manual) is \href{http://docs.julialang.org/en/latest/stdlib/}{here}.
\item There is a vibrant and growing \texttt{julia} community whose gateway is \href{http://julialang.org/community/}{here}.
\item There is a large and growing list of contributed packages \href{http://docs.julialang.org/en/latest/packages/packagelist/}{here}.
\end{itemize}
\section[Plotting with Winston]{Plotting with Winston}
\label{sec-4}

There's a pretty well fleshed out plotting example in the Graphics
section of \href{file://ob-julia-doc.org}{Org-mode and \texttt{julia}: an introduction}.  Check it out.
\section[Fitting (generalized) linear models]{Fitting (generalized) linear models}
\label{sec-5}

Douglas Bates (of \href{http://www.springer.com/statistics/statistical+theory+and+methods/book/978-1-4419-0317-4}{Mixed Effects Models in S and S-PLUS} fame) has been
putting together a \texttt{julia} package called GLM which already supports
fitting generalized linear models to datasets.  This, together with
the RDatasets package means there is already a bunch of stuff to keep
a person busy.  Below is a modified example from the Multiple
Regression chapter of IPSUR, translated to \texttt{julia} speak.

First, we start \texttt{using} the packages we'll need.

\begin{verbatim}
using RDatasets, DataFrames, Distributions, GLM
\end{verbatim}

Next we load the \texttt{trees} data frame from the RDatasets package (via
the DataFrames package) and fit a linear model to the data.

\begin{verbatim}
trees = data("datasets", "trees")
treeslm = lm(:(Girth ~ Height + Volume), trees)
\end{verbatim}

There is a \emph{ton} of output from both the above commands which we omit
here for the sake of brevity.  Most of it, though, is similar to to
output we might see in an R session.  We can extract the model
coefficients with the \texttt{coef} function:

\begin{verbatim}
coef(treeslm)
\end{verbatim}

\begin{verbatim}
3-element Float64 Array:
 10.8164   
 -0.0454835
  0.19518
\end{verbatim}

and we can finish by looking at a summary table similar to something
like \texttt{summary(treeslm)} in R.

\begin{verbatim}
coeftable(treeslm)
\end{verbatim}

\begin{verbatim}
3x4 DataFrame:
          Estimate Std.Error  t value   Pr(>|t|)
[1,]       10.8164    1.9732  5.48165 7.44691e-6
[2,]    -0.0454835 0.0282621 -1.60935   0.118759
[3,]       0.19518 0.0109553  17.8161 8.2233e-17
\end{verbatim}
% Generated by Org mode 7.9.3f in Emacs 24.3.50.1.
\end{document}